starter/openfoam/additivefoam/verificationAndValidation/marangoni/constant/thermoPath
(
0.0000    1.0000
1.0000    0.0000
)
