starter/openfoam/additivefoam/verificationAndValidation/marangoni/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0;
        smoother        DIC;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "T.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-15;
        relTol          0;
        minIter         1;
        maxIter         20;
    }
}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors 1;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;


    nThermoCorrectors   20;
    thermoTolerance     1e-8;
    explicitSolve       true;
}

relaxationFactors
{
    equations
    {
        ".*"   1;
    }
}

// ************************************************************************* //
